## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 1 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                      NAME                      |
|----------|------------------------------------------------|
| update   | `module.ai_answers.aws_ecs_service.this`       |
| recreate | `aws_security_group.ecs_tasks`                 |
|          | `aws_security_group_rule.ecs_egress_all`       |
|          | `aws_security_group_rule.ecs_egress_database`  |
|          | `aws_security_group_rule.ecs_ingress_lb`       |
| add      | `aws_security_group_rule.database_ingress_ecs` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.ecs_tasks must be replaced
-/+ resource "aws_security_group" "ecs_tasks" {
      ~ arn                    = "arn:aws:ec2:ca-central-1:992382783569:security-group/sg-085c606383f33733e" -> (known after apply)
      ~ description            = "Allow inbound and outbound traffic for AI Answers" -> "Allow inbound and outbound traffic for ai-answers staging" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow ECS security group to send all traffic"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow ECS to talk to the DocumentDB cluster"
              - from_port        = 27017
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-04966047bf236b850",
                ]
              - self             = false
              - to_port          = 27017
            },
        ]
      ~ id                     = "sg-085c606383f33733e" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow the ecs security group to receive traffic only from the load balancer on port 3001"
              - from_port        = 3001
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-08e35f1019824d56a",
                ]
              - self             = false
              - to_port          = 3001
            },
        ]
        name                   = "ai-answers-security-group"
      + name_prefix            = (known after apply)
      ~ owner_id               = "992382783569" -> (known after apply)
        tags                   = {
            "CostCentre" = "ai-answers-staging"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_security_group_rule.database_ingress_ecs will be created
  + resource "aws_security_group_rule" "database_ingress_ecs" {
      + description              = "Allow DocumentDB cluster to receive requests from ECS"
      + from_port                = 27017
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-04966047bf236b850"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 27017
      + type                     = "ingress"
    }

  # aws_security_group_rule.ecs_egress_all must be replaced
-/+ resource "aws_security_group_rule" "ecs_egress_all" {
      ~ id                       = "sgrule-3679506382" -> (known after apply)
      ~ security_group_id        = "sg-085c606383f33733e" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0f412e1fd0d771752" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_security_group_rule.ecs_egress_database must be replaced
-/+ resource "aws_security_group_rule" "ecs_egress_database" {
      ~ id                       = "sgrule-881858147" -> (known after apply)
      ~ security_group_id        = "sg-085c606383f33733e" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-016682d500ff42e0b" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_security_group_rule.ecs_ingress_lb must be replaced
-/+ resource "aws_security_group_rule" "ecs_ingress_lb" {
      ~ id                       = "sgrule-2118413993" -> (known after apply)
      ~ security_group_id        = "sg-085c606383f33733e" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0947259996e0a3a63" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.ai_answers.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:992382783569:service/ai-answers-cluster/ai-answers-app-service"
        name                               = "ai-answers-app-service"
        tags                               = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-085c606383f33733e",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 5 to add, 1 to change, 4 to destroy.

Changes to Outputs:
  ~ ecs_tasks_security_group_id = "sg-085c606383f33733e" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ai_answers_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_ssm_parameter.sentinel_forwarder_auth"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
